; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	instrument14 - instrument
	satellite7 - satellite
	instrument15 - instrument
	satellite8 - satellite
	instrument16 - instrument
	satellite9 - satellite
	instrument17 - instrument
	instrument18 - instrument
	satellite10 - satellite
	instrument19 - instrument
	instrument20 - instrument
	satellite11 - satellite
	instrument21 - instrument
	instrument22 - instrument
	instrument23 - instrument
	satellite12 - satellite
	instrument24 - instrument
	infrared1 - mode
	image0 - mode
	GroundStation1 - direction
	Star2 - direction
	Star0 - direction
	GroundStation4 - direction
	Star3 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star3)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star3)
	(supports instrument5 image0)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
	(supports instrument6 image0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star2)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument7 image0)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 infrared1)
	(supports instrument8 image0)
	(calibration_target instrument8 Star3)
	(supports instrument9 image0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star0)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
	(supports instrument10 infrared1)
	(supports instrument10 image0)
	(calibration_target instrument10 Star3)
	(supports instrument11 image0)
	(supports instrument11 infrared1)
	(calibration_target instrument11 Star0)
	(supports instrument12 infrared1)
	(calibration_target instrument12 Star2)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon9)
	(supports instrument13 infrared1)
	(supports instrument13 image0)
	(calibration_target instrument13 Star0)
	(supports instrument14 infrared1)
	(calibration_target instrument14 GroundStation1)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star5)
	(supports instrument15 infrared1)
	(supports instrument15 image0)
	(calibration_target instrument15 GroundStation1)
	(on_board instrument15 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star3)
	(supports instrument16 image0)
	(supports instrument16 infrared1)
	(calibration_target instrument16 GroundStation4)
	(on_board instrument16 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Star5)
	(supports instrument17 infrared1)
	(supports instrument17 image0)
	(calibration_target instrument17 Star3)
	(supports instrument18 image0)
	(supports instrument18 infrared1)
	(calibration_target instrument18 Star2)
	(on_board instrument17 satellite9)
	(on_board instrument18 satellite9)
	(power_avail satellite9)
	(pointing satellite9 Phenomenon9)
	(supports instrument19 image0)
	(supports instrument19 infrared1)
	(calibration_target instrument19 Star0)
	(supports instrument20 image0)
	(supports instrument20 infrared1)
	(calibration_target instrument20 GroundStation4)
	(on_board instrument19 satellite10)
	(on_board instrument20 satellite10)
	(power_avail satellite10)
	(pointing satellite10 Planet7)
	(supports instrument21 infrared1)
	(supports instrument21 image0)
	(calibration_target instrument21 Star3)
	(supports instrument22 infrared1)
	(supports instrument22 image0)
	(calibration_target instrument22 Star3)
	(supports instrument23 infrared1)
	(supports instrument23 image0)
	(calibration_target instrument23 GroundStation4)
	(on_board instrument21 satellite11)
	(on_board instrument22 satellite11)
	(on_board instrument23 satellite11)
	(power_avail satellite11)
	(pointing satellite11 Phenomenon6)
	(supports instrument24 image0)
	(calibration_target instrument24 Star3)
	(on_board instrument24 satellite12)
	(power_avail satellite12)
	(pointing satellite12 Planet7)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite8 Star0)
	(pointing satellite9 Phenomenon6)
	(pointing satellite10 Phenomenon9)
	(have_image Star5 image0)
	(have_image Phenomenon6 infrared1)
	(have_image Planet7 infrared1)
	(have_image Planet8 infrared1)
	(have_image Phenomenon9 infrared1)
))

)

; plan
1. (turn_to satellite8 star0 star5)
   deleted: (pointing satellite8 star5)
   added: (pointing satellite8 star0)
   goals met: 1 of 9
2. (turn_to satellite10 star0 planet7)
   deleted: (pointing satellite10 planet7)
   added: (pointing satellite10 star0)
   goals met: 1 of 9
3. (switch_on instrument19 satellite10)
   deleted: (power_avail satellite10)
   added: (power_on instrument19)
   goals met: 1 of 9
4. (calibrate satellite10 instrument19 star0)
   added: (calibrated instrument19)
   goals met: 1 of 9
5. (turn_to satellite10 planet8 star0)
   deleted: (pointing satellite10 star0)
   added: (pointing satellite10 planet8)
   goals met: 1 of 9
6. (take_image satellite10 planet8 instrument19 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 2 of 9
7. (turn_to satellite10 planet7 planet8)
   deleted: (pointing satellite10 planet8)
   added: (pointing satellite10 planet7)
   goals met: 2 of 9
8. (take_image satellite10 planet7 instrument19 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 3 of 9
9. (turn_to satellite10 phenomenon6 planet7)
   deleted: (pointing satellite10 planet7)
   added: (pointing satellite10 phenomenon6)
   goals met: 3 of 9
10. (turn_to satellite0 star3 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star3)
   goals met: 4 of 9
11. (take_image satellite10 phenomenon6 instrument19 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 5 of 9
12. (turn_to satellite10 star5 phenomenon6)
   deleted: (pointing satellite10 phenomenon6)
   added: (pointing satellite10 star5)
   goals met: 5 of 9
13. (take_image satellite10 star5 instrument19 image0)
   added: (have_image star5 image0)
   goals met: 6 of 9
14. (turn_to satellite10 phenomenon9 star5)
   deleted: (pointing satellite10 star5)
   added: (pointing satellite10 phenomenon9)
   goals met: 7 of 9
15. (take_image satellite10 phenomenon9 instrument19 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 8 of 9
16. (turn_to satellite9 phenomenon6 phenomenon9)
   deleted: (pointing satellite9 phenomenon9)
   added: (pointing satellite9 phenomenon6)
   goals met: 9 of 9
